app/Controllers/Admin.php

    public function notifItem()
    {
        $donate       = new DonateModel();
        $data = [
            'data' => $donate->where('notification', 1)->findAll(),
        ];
---
SELECT *
FROM `donate`
WHERE `notification` = 1

    public function notifCount()
    {
        $donate       = new DonateModel();
        $data = $donate->where('notification', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `donate`
WHERE `notification` = 1

    public function notifStatusChange()
    {
        if ($this->request->getPost('status')) {
            $donate = new DonateModel();
            $donate->set('notification', 2)->where('notification', 1)->update();
---
UPDATE `donate` SET `notification` = 2
WHERE `notification` = 1

        function bulan($a)
        {
            $visitor = new VisitorsModel();
            $bulan = $visitor->where('MONTH(created_at)', $a)->where('YEAR(created_at)', date('Y'))->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `visitors`
WHERE MONTH(created_at) = 1
AND YEAR(created_at) = '2023'