app/Controllers/Article.php

SELECT *
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
ORDER BY `date` DESC
---
    public function index()
    {
        $article = new ArticlesModel();
        $user       = new UsersModel();
        $data = [
            'user'  => $user->find(session()->get('id_users')),
            'articles' => $article->join('categories', 'categories.id_categories = articles.id_categories')->orderBy('date', 'desc')->findAll(),

SELECT *
FROM `users`
WHERE `users`.`id_users` = '4'
---
    public function add()
    {
        $category = new CategoriesModel();
        $user       = new UsersModel();
        $data = [
            'user'  => $user->find(session()->get('id_users')),
            'categories' => $category->findAll(),
        ];