app/Controllers/Donate.php

    public function verify()
    {
        $thumbnail = $this->request->getFile('bukti');
        if ($thumbnail->getError() == 4) {
            $thumbnailName = 'default.jpg';
        } else {
            $thumbnailName = $thumbnail->getRandomName();
            $thumbnail->move('img', $thumbnailName);
        }

        $donate  = new DonateModel();
        $donate->replace([
            'id_donate' => $this->request->getPost('id_donate'),
            'donors' => $this->request->getPost('donors'),
            'npm' => $this->request->getPost('npm'),
            'title' => $this->request->getPost('title'),
            'author' => $this->request->getPost('author'),
            'picture' => $thumbnailName,
            'status' => 1,
            'id_users' => session()->get('id_users'),
        ]);
---
SELECT *
FROM `users`
WHERE `users`.`id_users` = '4'

    public function verification()
    {
        $donate = new DonateModel();
        $prodi = new ProdiModel();
        $user       = new UsersModel();
        $data = [
            'user'  => $user->find(session()->get('id_users')),
            'prodies' => $prodi->findAll(),
            'donates' => $donate->where(['status' => 0, 'donors IS NOT NULL' => NULL, false])->findAll(),
---
SELECT *
FROM `prodi`
SELECT *
FROM `donate`
WHERE `status` = 0
AND `donors` IS NOT NULL
AND 0 = 0