app/Controllers/Home.php

    public function donate()
    {
        $visitor = new VisitorsModel();
        $visitor->save([
            'type' => 1,
            'id_articles' => 1
        ]);

        $prodi = new ProdiModel();
        $donate = new DonateModel();
        $data = [
            'prodies' => $prodi->findAll(),
            'donates' => $donate->where(['status' => 0, 'donors' => NULL])->findAll(),
---
INSERT INTO `visitors` (`type`, `id_articles`) VALUES (1, 1)
SELECT *
FROM `donate`
WHERE `status` = 0
AND `donors` IS NULL